app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user = current_user
    if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lemon"], ["price", 5.0], ["created_at", "2018-12-19 20:17:58.923577"], ["updated_at", "2018-12-19 20:17:58.923577"], ["user_id", 1]]